Revit 2027 API
ImageTypeOptions.Resolution Property
 The Resolution of the image is expressed in dots-per-inch and hence determines the size of a pixel in the image.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Resolution { get; set; }
Public Property Resolution As Double
	Get
	Set
public:
property double Resolution {
	double get ();
	void set (double value);
}
member Resolution : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for resolution must be positive.
Remarks
 For raster based image formats (*.bmp, *.jpg, *.jpeg, *.png, *.tif) the Resolution is used to calculate the size of the image from the number of pixels in the horizontal and vertical directions.
 For PDF files, which have a known paper size, the Resolution is used to control the amount of detail to capture in the image. Increasing the Resolution of PDF based images will add more detail to the image, but will also increase the amount of data stored in the project file.
 The default value of this property is 72 dpi.
See Also
Reference
ImageTypeOptions Class
Autodesk.Revit.DB Namespace